In [1]:
import pandas as pd
import numpy as np

# DataFrame groupby method

## Tasks

Write your code in the python cells, following the comments, so that you output must be equal to the given

### Task 1: Find average sales for each product

Create sample DataFrame with product sales data and calculate the average sales for each product.

In [7]:
np.random.random_integers(1, 100, size=10).tolist()

C:\Users\zehir\AppData\Local\Temp\ipykernel_19980\2195536991.py:1: DeprecationWarning: This function is deprecated. Please call randint(1, 100 + 1) instead
  np.random.random_integers(1, 100, size=10).tolist()

[11, 29, 36, 16, 18, 24, 80, 86, 86, 97]

In [21]:
# Create sample DataFrame

df = pd.DataFrame(

    {
        'COL1':[np.random.choice(['A', 'B', 'C']) for _ in range(10)], 
        'COL2':np.random.randint(101, 201, size=10), 
        'COL3':np.random.randint(201, 300, size=10)
    }
    
)

df

  COL1  COL2  COL3
0    A   194   202
1    A   127   266
2    B   107   211
3    C   135   232
4    B   182   228
5    C   164   267
6    B   174   228
7    B   193   257
8    C   182   239
9    A   172   287

In [22]:
# Calculate the average sales for each product.

df.groupby('COL1').mean()

            COL2        COL3
COL1
A     164.333333  251.666667
B     164.000000  231.000000
C     160.333333  246.000000

### Task 2: Calculate class stats

Given a DataFrame with student scores, calculate the minimum, maximum, and average score for each class.

In [23]:
# Sample DataFrame
data = {
    'Class': ['Math', 'Science', 'Math', 'Science', 'Math', 'Science'],
    'Score': [85, 90, 78, 88, 92, 95]
}
df = pd.DataFrame(data)
df

     Class  Score
0     Math     85
1  Science     90
2     Math     78
3  Science     88
4     Math     92
5  Science     95

In [28]:
# calculate the minimum, maximum, and average score for each class.

df.groupby('Class').agg(['max', 'min', 'mean'])
df.groupby('Class').agg(min=('Score', 'min'), max=('Score', 'max'))

         min  max
Class
Math      78   92
Science   88   95

### Task 3: Count number of orders in each category

Given a DataFrame with product order data,  count the number of orders in each category.

In [29]:
# Sample DataFrame
data = {
    'OrderID': [101, 102, 103, 104, 105, 106],
    'Category': ['Electronics', 'Clothing', 'Electronics', 'Clothing', 'Electronics', 'Furniture']
}
df = pd.DataFrame(data)
df

   OrderID     Category
0      101  Electronics
1      102     Clothing
2      103  Electronics
3      104     Clothing
4      105  Electronics
5      106    Furniture

In [37]:
# count the number of orders in each category.
df['Category'].value_counts()

Category
Electronics    3
Clothing       2
Furniture      1
Name: count, dtype: int64

### Tasks on drinks dataset

#### Task 0: Load [drinks.csv](https://github.com/geekcourses/JupyterNotebooksExamples/blob/master/datasets/various/drinks.csv) and show the first 5 rows

In [69]:
# load datasets
df = pd.read_csv('./datasets/drinks.csv')
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

#### Task 1: Calculate the average beer servings for each continent.

In [48]:
# your code here
df.loc[:, ['continent' , 'beer_servings']].groupby('continent').mean()

           beer_servings
continent
AF             61.471698
AS             37.045455
EU            193.777778
OC             89.687500
SA            175.083333

#### Task 2: Which continent consumes max wine in total

In [67]:
# your code here
df.groupby('continent')['wine_servings'].max().idxmax()

'EU'

#### Task 3: Identify the country with the highest beer servings within each continent.

In [86]:
# your code here
df.groupby(['continent', 'country'])['beer_servings'].max().idxmax()

('AF', 'Namibia')

#### Task 4: Calculate the sum of all alcoholic beverage servings (beer, spirit, wine) by continent.

In [99]:
# your code here

df['wine_beer_servings_sum'] = df['wine_servings'] + df['beer_servings'] 
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,wine_beer_servings_sum
0,Afghanistan,0,0,0,0.0,AS,0
1,Albania,89,132,54,4.9,EU,143
2,Algeria,25,0,14,0.7,AF,39
3,Andorra,245,138,312,12.4,EU,557
4,Angola,217,57,45,5.9,AF,262
...,...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA,336
189,Vietnam,111,2,1,2.0,AS,112
190,Yemen,6,0,0,0.1,AS,6
191,Zambia,32,19,4,2.5,AF,36
192,Zimbabwe,64,18,4,4.7,AF,68

#### Task 5: Find countries where the total litres of pure alcohol is above the global average.

In [105]:
# your code here
threshold = df.total_litres_of_pure_alcohol.mean()
threshold

np.float64(4.717098445595855)

In [111]:
filtered_df = df.loc[df['total_litres_of_pure_alcohol'] > threshold, ['country', 'total_litres_of_pure_alcohol']]
print(filtered_df)

               country  total_litres_of_pure_alcohol
1              Albania                           4.9
3              Andorra                          12.4
4               Angola                           5.9
5    Antigua & Barbuda                           4.9
6            Argentina                           8.3
..                 ...                           ...
182     United Kingdom                          10.4
183           Tanzania                           5.7
184                USA                           8.7
185            Uruguay                           6.6
188          Venezuela                           7.7

[90 rows x 2 columns]